app/Controllers/ProfileController.php

INSERT INTO `etarias` (`idade`, `situacao`) VALUES ('66', 'Obrigatorio')
---
    public function store()
    {
        helper(['form']);
        $rules = [
            'idade' => 'required|min_length[2]|max_length[50]'
        ];

        if($this->validate($rules)){
            $etariaModel = new EtariaModel();
            $data = [
                'idade'     => $this->request->getVar('idade'),
                'situacao'    => $this->request->getVar('situacao')
            ];
            $etariaModel->save($data);