app/Controllers/SignupController.php

    public function store()
    {
        helper(['form']);
        $rules = [
            'name'          => 'required|min_length[2]|max_length[50]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]',
            'password'      => 'required|min_length[4]|max_length[50]',
            'confirmpassword'  => 'matches[password]'
        ];

        if($this->validate($rules)){
            $userModel = new UserModel();
            $data = [
                'name'     => $this->request->getVar('name'),
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $userModel->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('joao', 'joa@hotmail.com', '$2y$10$0mZRH56zf7hg9VqrmWmn2uAhunyO2KzEePgpIgNo7rtFzsnATCdGW')